cf/Tasks/ЗадачаПользователю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Task>
		<Properties>
			<Name>ЗадачаПользователю</Name>
			<Addressing>InformationRegister.РолиПользователей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъедененнаяСборка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъедененнаяСборка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параллельная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Роли</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cf/InformationRegisters/СкладыПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СкладыПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Tasks/ЗадачаПользователю/Forms/ФормаРангЗадач/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пользователь = ПараметрыСеанса.ТекущийПользователь; 
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	ПерезаполнитьНастройкиПользователя();
	ОбновитьСписокЗадач();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНастройкиПользователя()
	
	ВыбранныеСклады.ЗагрузитьЗначения(ПолучитьСкладыПользователя(Пользователь));
	ВыбранныеТочкиМаршрута.ЗагрузитьЗначения(ПолучитьТочкиМаршрутаВыбранныхРолей());
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеСкладыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ОтметитьСписок", 
		Новый Структура("Список", ПолучитьСписокСУстановленнымиОтметками(ВыбранныеСклады, ПолучитьСкладыПользователя(Пользователь))), 
		ЭтаФорма,,,, Новый ОписаниеОповещения("ОтмеченСписок", ЭтаФорма, Новый Структура("Список", "ВыбранныеСклады")));

КонецПроцедуры
	
&НаКлиенте
Функция ПолучитьСписокСУстановленнымиОтметками(Список, МассивЗначений)
	
	// Возвращает список с отмеченными элементами
	// Создается новый список и заполняет его МассивЗначений
	// дальше выставляется галки тем элементам которые есть в списке и массиве или только в массиве
	
	новСписок = Новый СписокЗначений;
	Для Каждого Значение Из МассивЗначений Цикл новСписок.Добавить(Значение,,Список.НайтиПоЗначению(Значение) <> Неопределено) КонецЦикла;
	
	Возврат новСписок;
	
КонецФункции

&НаСервере
Функция ПолучитьСкладыПользователя(выбПользователь) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Склад ИЗ РегистрСведений.СкладыПользователя ГДЕ Пользователь = &ТекПользователь");	
	Запрос.УстановитьПараметр("ТекПользователь", выбПользователь);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	
КонецФункции

&НаКлиенте
Процедура ОтмеченСписок(Список, ДопПараметры) Экспорт
	
	Если Список <> Неопределено Тогда
		
		текСписок = ЭтотОбъект[ДопПараметры.Список];
		текСписок.Очистить();
		Для Каждого Элемент Из Список Цикл Если Элемент.Пометка Тогда текСписок.Добавить(Элемент.Значение) КонецЕсли; КонецЦикла; 
		
		ОбновитьСписокЗадач(); КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьСписокЗадач()
	
	текПользователи = Новый Массив;
	текПользователи.Добавить(Справочники.Пользователи.ПустаяСсылка());
	текПользователи.Добавить(Пользователь);
	
	текСклады = ВыбранныеСклады.ВыгрузитьЗначения();
	текСклады.Добавить(Справочники.Склады.ПустаяСсылка());
	
	Список.Параметры.УстановитьЗначениеПараметра("Склады", 				текСклады);
		
	Список.Параметры.УстановитьЗначениеПараметра("ТочкиМаршрута", 		ВыбранныеТочкиМаршрута.ВыгрузитьЗначения());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТочкиМаршрутаВыбранныхРолей() Экспорт
	
	Точки = Новый Массив;
	
	Точки.Добавить(БизнесПроцессы.СборкаТовара.ТочкиМаршрута.СобратьТовар);
	Точки.Добавить(БизнесПроцессы.ПеремещениеТоваров.ТочкиМаршрута.ОтправитьТовар);
	
	Возврат Точки;
	
КонецФункции

&НаКлиенте
Процедура ВыбранныеТочкиМаршрутаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ОтметитьСписок", 
	Новый Структура("Список", ПолучитьСписокСУстановленнымиОтметками(ВыбранныеТочкиМаршрута, ПолучитьТочкиМаршрутаВыбранныхРолей())), 
	ЭтаФорма,,,, Новый ОписаниеОповещения("ОтмеченСписок", ЭтаФорма, Новый Структура("Список", "ВыбранныеТочкиМаршрута")));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Парам = Новый Структура("Ключ", Элемент.ТекущиеДанные.Ссылка); 
	ОткрытьФорму("Задача.ЗадачаПользователю.Форма.ФормаЗадачи", Парам);
КонецПроцедуры
